{
	"siteVersion": "1.127.2",
	"_meta": {
		"sources": [
			{
				"json": "FeyNine-Tails",
				"abbreviation": "AWW",
				"full": "Arashi Wild World",
				"url": "",
				"authors": [
					"Arashi Keaton"
				],
				"convertedBy": [
					"scz"
				]
			}
		],
		"dateAdded": 1619646895,
		"dateLastModified": 1619646895
	},
	"spell": [
		{
			"name": "Blazing Foxfire",
			"level": 0,
			"school": "I",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "self"
				}
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "hour",
						"amount": 1
					}
				}
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Sorcerer (Kitsune Bloodline)",
						"source": "FeyNine-Tails"
					}
				]
			},
			"entries": [
				"A flickering, arcane flame appears in your hand or from your tail. The flame is non-damaging, blue and of a fey nature. The maximum size of the flame is a 6 ft square cube, increase it by 1 sq ft per sorcerer level. The flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. You can double or halve the area of bright light and dim light cast by the flame.",
				"You can replace any open, non-magical flame (limited by the maximum volume of your flame) with your foxfire. If you remove your foxfire the real flame can be extinguished or stay alight by your choice.",
				"When this spell is cast you can move your foxfire to anywhere within this spells damaging range. You can use your bonus action on subsequent turns to move and animate this flame.",
				"You can animate the flame in the following way. You cause shapes—such as the form of a creature, an inanimate object, or a location—to appear within the flames and animate as you like. The color can change to any shade of blue. You can also use the sound of burning fire to roar, create fiery noises, and even communicate verbally.",
				"You can also attack with the flame. This does not end the spell. When you cast this spell, or as an action on a later turn, you can hurl the flame at a creature within 60 feet (120 ft at 6th lvl, 300 ft at 12th lvl, 1000 ft at 18th lvl) of you. If you have shaped the flame the attack will simulate the form physically attacking your target. Make a ranged spell attack. On a hit, the target takes {@damage 1d10} fire damage. ",
				"This spell's damage increases by {@dice 1d10} when you reach 5th level ({@dice 2d10}), 11th level ({@dice 3d10}), and 17th level ({@dice 4d10}). At 2nd level, you can split the flame into two separate magical fires and move them independently. The volume of flame remains the same. You gain one more flame at 6th, 12th and 18th level. This does not let you attack multiple times but you can now attack multiple targets and split the damage rounded down.",
				"At 18th level, your foxfire is now permanently ablaze and under the careful spell metamagic enhancement. Any creature or object you choose within 5 feet of your foxfire must make a Dexterity saving throw or is set aflame and takes {@damage 1d10} fire damage at the beginning of its turn. They cannot put themselves out with an action if they remain within or near your foxfire.",
				"A flammable object hit by this spell ignites if it isn't being worn or carried.",
				"If you cast this spell again this will cancel any active foxfire spell in play"
			],
			"source": "FeyNine-Tails",
			"races": [
				{
					"name": "Kitsune (Nine-tails)",
					"source": "PHB",
					"baseName": "Kitsune",
					"baseSource": "FeyNine-Tails"
				}
			],
			"spellAttack": [
				"R"
			],
			"damageInflict": [
				"psychic"
			],
			"areaTags": [
				"ST"
			],
			"components": {
				"v": true,
				"s": true
			},
			"fluff": {
				"entries": [
					"The fey flames of the fox burns within, use them wisely.",
					"You can attack with the flame. When you cast this spell, or as an action on a later turn, you can hurl the flame at a creature within 120 feet of you. If you have shaped the flame the attack will simulate the form physically attacking your target. Make a ranged spell attack. On a hit, the target takes 1d8 psychic damage. If you cast this spell again this will cancel any active foxfire spell in play."
				]
			},
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you attack with this spell you may use a 1st level spell slot or higher to increase the damage, the damage increases by {@dice 1d10} for each slot level used."
					]
				}
			]
		}
	]
}