{
	"siteVersion": "1.127.2",
	"_meta": {
		"sources": [
			{
				"json": "FeyNine-Tails",
				"abbreviation": "AWW",
				"full": "Arashi Wild World",
				"url": "",
				"authors": [
					"Arashi Keaton"
				],
				"convertedBy": [
					"scz"
				]
			}
		],
		"dateAdded": 1619644744,
		"dateLastModified": 1619644744
	},
	"monster": [
		{
			"name": "Arashi Keaton (Nine-Tails)",
			"size": "M",
			"type": "fey",
			"source": "FeyNine-Tails",
			"alignment": [
				{
					"alignment": [
						"N",
						"G"
					]
				},
				{
					"alignment": [
						{
							"special": "rebel good"
						}
					]
				}
			],
			"ac": [
				20,
				{
					"ac": 31,
					"from": [
						"{@item glamoured studded leather}"
					],
					"condition": "when going to adventure",
					"braces": true
				}
			],
			"hp": {
				"formula": "25d10 + 125",
				"average": 262
			},
			"speed": {
				"walk": 45,
				"fly": {
					"number": 40,
					"condition": "(hover)"
				},
				"canHover": true
			},
			"str": 18,
			"dex": 26,
			"con": 20,
			"int": 14,
			"wis": 25,
			"cha": 25,
			"passive": 26,
			"cr": "30",
			"level": 21,
			"senses": [
				"truesight 120 ft."
			],
			"senseTags": [
				"U"
			],
			"languages": [
				"Common",
				"Sylvan",
				"Elvish",
				"Rutan"
			],
			"languageTags": [
				"C",
				"S",
				"E"
			],
			"save": {
				"dex": "+17",
				"wis": "+16",
				"cha": "+16",
				"str": "+14",
				"con": "+17",
				"int": "+10"
			},
			"skill": {
				"insight": "+25",
				"perception": "+16",
				"persuasion": "+16",
				"deception": "+16",
				"acrobatics": "+17",
				"investigation": "+8",
				"performance": "+16",
				"sleight of hand": "+17",
				"stealth": "+17",
				"animal handling": "+2",
				"arcana": "+5",
				"athletics": "+12",
				"history": "+8",
				"intimidation": "+16",
				"medicine": "+8",
				"nature": "+5",
				"religion": "+0",
				"survival": "+5"
			},
			"conditionImmune": [
				{
					"conditionImmune": [
						"charmed"
					]
				},
				{
					"conditionImmune": [
						"frightened"
					]
				},
				{
					"conditionImmune": [],
					"preNote": "Disease"
				},
				{
					"conditionImmune": [
						"unconscious"
					]
				}
			],
			"immune": [
				{
					"immune": []
				},
				{
					"immune": [
						"fire"
					]
				},
				{
					"immune": [
						"psychic"
					]
				}
			],
			"spellcasting": [
				{
					"name": "Innate  Spellcasting",
					"headerEntries": [
						"The nine-tail's innate spellcasting ability is Charisma (spell save {@dc 23}, +15 to hit with spell attacks). The nine-tails can innately cast the following spells, requiring no material components:"
					],
					"will": [
						"{@spell blazing foxfire|FeyNine-Tails}",
						"{@spell blur}",
						"{@spell booming blade|TCE}",
						"{@spell burning hands}",
						"{@spell disguise self}",
						"{@spell foxfire|FeyNine-Tails}",
						"{@spell invisibility}",
						"{@spell lightning lure|TCE}",
						"{@spell mage hand}",
						"{@spell minor illusion}",
						"{@spell mirror image}",
						"{@spell misty step}",
						"{@spell phantasmal force}",
						"{@spell prestidigitation}",
						"{@spell shocking grasp}",
						"{@spell silent image}"
					],
					"daily": {
						"5e": [
							"{@spell fireball}",
							"{@spell foxfire cloak|FeyNine-Tails}",
							"{@spell greater invisibility}",
							"{@spell hallucinatory terrain}",
							"{@spell hypnotic pattern}",
							"{@spell lightning bolt}",
							"{@spell major image}",
							"{@spell phantasmal killer}",
							"{@spell shadow blade|XGE}",
							"{@spell steel wind strike|XGE}"
						],
						"3e": [
							"{@spell creation}",
							"{@spell delayed blast fireball}",
							"{@spell destructive wave}",
							"{@spell fire storm}",
							"{@spell mirage arcane}",
							"{@spell mislead}",
							"{@spell wall of fire}",
							"{@spell wall of force}"
						],
						"1e": [
							"{@spell meteor swarm}",
							"{@spell plane shift}",
							"{@spell storm of vengeance}",
							"{@spell weird}"
						]
					},
					"ability": "cha",
					"type": "spellcasting"
				}
			],
			"spellcastingTags": [
				"I"
			],
			"trait": [
				{
					"name": "Keen Senses",
					"entries": [
						"Arashi has advantage on Wisdom (perception) checks."
					]
				},
				{
					"name": "Superior Truesight",
					"entries": [
						"He have Truesight out to a distance of 120ft. They can see through all illusions, even ones protected from Truesight, and can choose to dispel them instantly without a DC check as a bonus action."
					]
				},
				{
					"name": "Immortal Fey",
					"entries": [
						"Arashi is immortal. He cannot be aged. He heal double the hit dice on a short rest and a long rest only takes 4 hours. Over multiple long rests scars will fade, evidence of old wounds disappear and they can even replace lost body parts."
					]
				},
				{
					"name": "Previous Life",
					"entries": [
						"Over a hundred years since his transformation, Arashi haven't forgotten his skills as an Arcane Trickster, age have only hone them further, he haven't forgotten anything.  Charisma is his spellcasting ability."
					]
				},
				{
					"name": "Magic Resistance",
					"entries": [
						"Arashi is an immortal, fey creature. They have advantage on saving throws against spells and other magical effects."
					]
				},
				{
					"name": "True Illusion",
					"entries": [
						"Arashi´s illusions are so potent they gain a physical and self sustaining form. Visual illusions cast through their Innate Spellcasting feature do not require Arashi concentration. He can choose for the illusion to be immaterial or have physical substance. The True Illusion has one half the hit points, their to-hit is the Nine-tails spell attack and do one half the damage if applicable. Any spell or effect the illusion makes uses the foxfire cantrip."
					]
				},
				{
					"name": "Foxfire Savant",
					"entries": [
						"The foxfire a nine-tails can cast is legendary. Cast it as a 20th level sorcerer and double the range and flame volume of the cantrip. Arashi can choose to cast it with either the Empowered or Quickened metamagic at will."
					]
				},
				{
					"name": "Change Shape",
					"entries": [
						"Arashi changes shape into a nine-tailed fey fox. The fox retains the fur and eye color of its true form. It has a choice of changing shape into smaller versions of this form. Its Str, Con, Dex, Hit Die, Hit Points and range changes accordingly. It's Int, Wis and Cha remains the same. Any equipment it is wearing or carrying is absorbed or borne by the new form (the nine-tails choice). If this form is at zero hit points he cannot use this ability. Arashi must complete a long rest to bring it back to full hit points in both forms."
					]
				},
				{
					"name": "Feral Eruption",
					"entries": [
						"If the nine-tails is brought to zero hit points and its fox form is above zero hit points the nine-tails will immediately change shape in an eruption of foxfire into its fox form. Each creature in a 30-foot radius sphere centered on the nine-tails must make a {@dc 26} Dexterity saving throw. The sphere spreads around corners. A creature takes {@damage 20d6} fire damage on a failed save, or half as much damage on a successful one."
					]
				},
				{
					"name": "Enhanced Tail Casting",
					"entries": [
						"Nine-tails can cast some spells completely with their tails instead of using verbal chanting.",
						"All illusion spells you cast are automatically under the subtle spell metamagic enhancement. "
					]
				},
				{
					"name": "Blurred",
					"entries": [
						"The essence of illusion clings to the nine-tails skin. The nine-tails is constantly under the effect of the spell blur."
					]
				}
			],
			"traitTags": [
				"Keen Senses",
				"Magic Resistance"
			],
			"isNpc": true,
			"fluff": {
				"entries": [
					"A nine tailed kitsune is extremely rare, powerful and considered a true immortal, fey creature. It is an extraordinary achievement for a kitsune to be powerful and old enough to gain a ninth tail. Doing so is a great honor to them and to their clan.",
					"Note \\\\\\\"old enough\\\\\\\", Arashi was less than 22 when he earned his ninth tail, such sudden increase in power caused his body to change to endure the massive influx of power coursing thru his body. The once small and scrawny fox was no more, now he was a towering 8ft tall, 626lbs nine-tailed fox. This sudden change was enough to make him retire from adventuring until he fell more comfortable on his new frame, that took a decade. During that time he decided to follow his dream of opening and inn, the \\\\\\\"Foxes Nap\\\\\\\". Nowadays his size and weight do not hinder him in his roguish ways, even though he get stuck in smaller spaces more times that he is willing to admit. Due to his increase in size, he likes to wear clothes that are easy to move in, loose and with a large amount of pockets to put trinkets and items on.",
					"In general he is an easy going person, quick to help anyone who is in need and with a sly smile. Generally annoyed that his new appearance is overwhelming to others, even intimidating, but really he is a caring soul under all that .Hard to anger, but if you do, beware, his fey blood make him an vindictive bastard, and pray to whatever god you follow if he discover you are a slaver, his wrath will be brutal and swift. Don't break his trust on you, HE WILL REMEMBER.",
					"if found on the road:",
					"Will give help to neutral aligned players, unless they do something that he finds reprehensible. And will join for a while to aid good aligned player.",
					"if found on his inn:",
					"Depending on the state of the party he would give them a free night stay or charge them below average gold for the night.",
					"Will happily chat about his travels and misadventures with a laugh. Habed lived on the streets before, he knows how comforting a hot meal and a warm bed can be. If a fight is brewing in his in he will use one of his illusions to halt them, just for a bit so he can safeguard the expensive drinks he have behind the counter, and that he will only tolerate non lethal fighting, if someone is going for the kill he WILL get involved."
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "external",
							"url": "https://cdn.discordapp.com/attachments/804493615932899328/837011694801649734/Arashi_NineTails_flex.png"
						}
					},
					{
						"type": "image",
						"href": {
							"type": "external",
							"url": "https://cdn.discordapp.com/attachments/804493615932899328/837033053301243985/Arashi_K-3.png"
						}
					}
				]
			},
			"miscTags": [
				"MW",
				"AOE"
			],
			"legendaryHeader": [
				"Arashi can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. Arashi regains spent legendary actions at the start of its turn."
			],
			"legendary": [
				{
					"name": "Innate Spellcasting",
					"entries": [
						"Arashi can cast their At Will spells with 1 action, their 5/day with 2 actions, or their 3/day with 3 actions."
					]
				},
				{
					"name": "Change Shape",
					"entries": [
						"Arashi uses its change shape ability."
					]
				}
			],
			"shortName": "Arashi Keaton",
			"resist": [
				"cold"
			],
			"action": [
				{
					"name": "Fists",
					"entries": [
						"A powerful punch covered in arcane energy.",
						"{@atk mw} {@hit 13} to hit, reach 5 ft., one target. {@h}16 ({@damage 2d6 + 9}) slashing damage, plus 3 ({@damage 1d6}) force damage."
					]
				},
				{
					"name": "Tail Swipe",
					"entries": [
						"Melee Weapon Attack {@hit 17} to hit, reach 10ft., one target. {@h}19 ({@damage 2d8 + 10}) bludgeoning damage. The target of size large or smaller must succeed on a {@dc 24} Strength saving throw or be knocked back 20 ft and become {@condition prone}."
					]
				}
			],
			"damageTags": [
				"S",
				"O",
				"B"
			],
			"tokenUrl": "https://cdn.discordapp.com/attachments/804493615932899328/837021281647067146/token_1.png"
		}
	]
}